<template>
  <div data-aos="fade-up" data-aos-duration="1000" class="account px-4">
    <div class="account_Top d-flex align-items-center justify-content-between">
      <div class="aT_left d-flex align-items-center">
        <router-link to="/account/modify">
          <div class="icon">
            <i class="fa-solid fa-user"></i>
          </div>
        </router-link>
        <div class="info">
          <h3>{{ id }}</h3>
          <p>{{ email }}</p>
        </div>
      </div>
      <div class="pwdChange">
        <router-link to="/account/passwordOG">
          <button type="button">비밀번호 변경</button>
        </router-link>
      </div>
    </div>
    <div class="account_Bottom">
      <ul>
        <li class="d-flex justify-content-between">
          <div class="w-100 justify-content-between d-flex">
            <div class="aB_left d-flex align-items-center">
              <i class="fa-solid fa-mobile-screen-button" style="margin-left: 5px"></i>
              <p>컬러 모드</p>
            </div>
            <div class="d-flex align-items-center gap-2 justify-content-between">
              <span v-if="isDarkModeActive">White</span>
              <span v-else>Black</span>
              <button
                type="button"
                class="position-relative colorBtn"
                @click="toggleDarkMode"
              >
                <input type="checkbox" id="toggle" class="toggle-input" />
                <label for="toggle" class="toggle-label" @click.stop></label>
              </button>
            </div>
          </div>
        </li>
        <li class="d-flex justify-content-between">
          <router-link to="/guide/main" class="w-100 justify-content-between d-flex">
            <div class="aB_left d-flex align-items-center">
              <i class="fa-regular fa-circle-question"></i>
              <p>MUCA 가이드</p>
            </div>
            <div>
              <button type="button"><i class="fa-solid fa-chevron-right"></i></button>
            </div>
          </router-link>
        </li>
        <li class="d-flex justify-content-between">
          <router-link to="/account/inquiry" class="w-100 justify-content-between d-flex">
            <div class="aB_left d-flex align-items-center">
              <i class="fa-solid fa-headset"></i>
              <p>1:1 문의</p>
            </div>
            <div>
              <router-link to="/account/inquiry">
                <button type="button"><i class="fa-solid fa-chevron-right"></i></button>
              </router-link>
            </div>
          </router-link>
        </li>
        <li class="d-flex justify-content-between">
          <div class="aB_left d-flex align-items-center accordion col-12 justifu-content-between" id="accordionExample">
            <div class="accordion-item w-100">
              <p class="accordion-header d-flex align-items-center" id="headingOne">
                <button
                  class="accordion-button"
                  type="button"
                  data-bs-toggle="collapse"
                  data-bs-target="#collapseOne"
                  aria-expanded="true"
                  aria-controls="collapseOne"
                >
                <div class="aB_left d-flex align-items-center">
                  <i class="fa-brands fa-app-store"></i>
                  앱정보
                </div>
                  
                </button>
                <div data-bs-toggle="collapse"
                  data-bs-target="#collapseOne"
                  aria-expanded="true"
                  aria-controls="collapseOne">
              <router-link to="#">
                <button type="button"><i class="fa-solid fa-chevron-right" style="font-size: 4.2vw"></i></button>
              </router-link>
            </div>
              </p>
              <div
                id="collapseOne"
                class="accordion-collapse collapse"
                aria-labelledby="headingOne"
                data-bs-parent="#accordionExample"
              >
                <div class="accordion-body">
                <ul>
                  <li><button type="button" data-bs-toggle="modal" data-bs-target="#iyong">이용약관</button></li>
                  <li><button type="button" data-bs-toggle="modal" data-bs-target="#gaein">개인정보 처리방침</button></li>
                </ul></div>
              </div>
            </div>
          </div>
        </li>
        <li class="d-flex justify-content-between">
          <div class="aB_left d-flex align-items-center">
            <i class="fa-solid fa-arrow-right-from-bracket"></i>
            <button type="button" data-bs-toggle="modal" data-bs-target="#logout">
              로그아웃
            </button>
          </div>
          <div></div>
        </li>
      </ul>
    </div>
  </div>

  <!-- 모달 -->

  <div
    class="modal fade logoutModal"
    id="logout"
    tabindex="-1"
    role="dialog"
    aria-labelledby="saveModalLabel"
    aria-hidden="true"
    data-bs-backdrop="static"
  >
    <div class="modal-dialog modal-dialog-centered w-75 mx-auto">
      <div class="modal-content">
        <div class="modal-body">
          <p>정말 로그아웃 하시겠습니까?</p>
        </div>
        <div class="modal-footer justify-content-center d-flex flex-row flex-nowrap">
          <button type="button" class="btn" data-bs-dismiss="modal">취소</button>
          <button type="button" class="btn" data-bs-dismiss="modal">확인</button>
        </div>
      </div>
    </div>
  </div>
  <div
    class="modal fade"
    id="appinfo"
    tabindex="-1"
    role="dialog"
    aria-labelledby="saveModalLabel"
    aria-hidden="true"
    data-bs-backdrop="static"
  >
    <div class="modal-dialog modal-dialog-centered w-75 mx-auto">
      <div class="modal-content">
        <div class="modal-body">
          <p>버젼: v.1.0.1</p>
        </div>
        <div class="modal-footer justify-content-center d-flex flex-row flex-nowrap">
          <button type="button" class="btn" data-bs-dismiss="modal">확인</button>
        </div>
      </div>
    </div>
  </div>

<div class="modal fade" tabindex="-1" id="iyong">
    <div class="modal-dialog modal-dialog-centered modal-dialog-scrollable">
      <div class="modal-content longTextModal">
        <div class="modal-header">
          <h5 class="modal-title">이용 약관</h5>
        </div>
        <div class="modal-body">
          <textarea readonly>
MUCA 서비스 이용에 관한 약관이며, 서비스를 이용함은 아래 약관을 동의하는것으로
간주합니다. 본 서비스는 주식회사 ㈜상상브레이커스 (이하 ‘당사’라고 합니다)가
제공하는 서비스입니다. 본 서비스 중 유료서비스의 경우, 본 서비스 내에서 별도
안내하는 이용료가 부과됩니다. 고객은 당사가 본 서비스상에서 제공하는 서비스를
이용하기에 앞서 본 이용계약의 내용을 승낙하여야 합니다. 이용하시기 전에 반드시
본 이용계약을 읽어 주십시오.

(1) 고객이 본 서비스를 이용하기 시작함으로써 고객과 당사간에 본 이용계약이
성립합니다. 본 이용계약을 승낙하지 않는 고객은 본 서비스를 이용할 수
없습니다.

(2) 본 이용계약의 체결 및 해지는 모두 고객이 소유하는 휴대폰 단말기 조작을
통해 합니다. 당사는 고객이 소유하는 휴대폰 단말기에서 이루어진 조작을 모두
고객의 의사로 간주합니다. 

(3) 당사는 본 서비스를 통해 다양한 콘텐츠를 제공합니다. 고객은 본 서비스를
고객의 휴대폰 단말기상에서만 이용하실 수 있습니다. 

(4) 고객은 본 서비스 이용료에 대해 아래 지불방법 중 본 서비스 내에서 별도로
안내하는 방법을 선택할 수 있습니다. 각 이용 기준은 해당 플랫폼 등의 이용
규약에 따릅니다. ① App Store, Google Play, 기타 명칭을 불문하고 본 서비스의
어플리케이션을 배포하는 플랫폼에서의 결제 ② 기타 본 서비스 내에서 별도로
안내하는 방법에 따른 결제 

(5) 당사는 본 서비스상 무료 또는 유료인 기능에 대해 당사 판단에 따라 가격을
변경할 수 있습니다. 고객은 해당 변경에 승낙하지 않으면 본 서비스의 전부 또는
일부를 이용할 수 없는 경우가 있는 것에 대해 사전에 승낙합니다. 

(6) 본 서비스 이용 시에 이용료 외에 별도로 통신료가 부과됩니다. 단, 통신료는
고객의 통신환경 및 개인이 가입하신 통신서비스에 따라 발생합니다. 

(7) 고객의 이용료 지불의무는 통신을 이용하지 못한 상태가 발생한 경우도
포함하여 어떠한 경우에도 면제되지 아니합니다. 

(8) 본 서비스를 설치하면 UUID가 부여됩니다. UUID는 어플리케이션 설치 시에
생성되는 ID이며, 휴대폰 단말기 고유의 정보인 UDID와 구별됩니다. 당사는 UUID를
고객의 본인 확인 및 본 서비스의 편의성 향상 등에 이용합니다. 

(9) 당사는 본 서비스와 관련하여 아래와 같은 정보(이하 ‘고객 정보’라 합니다)를
취득할 수 있습니다. ① 고객 개인에 관한 정보：고객이 본 서비스에 등록하여
당사에 등록한 계정명(고객의 실명인 경우를 포함합니다), 생년월일 및 성별,
출신지 등 ② 이용중인 휴대폰 단말기에 관한 정보：사용 디바이스, OS, 단말기 언어
설정 ③ 통신 환경에 관한 정보：통신사, 통신 환경, 접속 국가·지역 등 ④ 이용
상황에 관한 정보：본 서비스의 버전, 본 서비스의 이용이력 등 

(10) 당사는 고객 정보를 저장, 축적한 경우, 관리자의 주의로 취급하는 동시에,
다음과 같은 목적으로 사용합니다. ① 본 서비스의 운영(당사가 고객에게 문의 대응,
푸시 알림, 뉴스레터, 기타 본 서비스 내 안내 정보의 송부, 이벤트 등의 당첨자에
대한 상품 발송, 기타 본 서비스 내에서 게시하는 목적 등으로 모든 정보를
제공하는 것을 포함합니다) ② 당사가 고객에게 유익하다고 판단하는 당사 서비스(본
서비스에 한정하지 아니합니다) 또는 광고주 기업 또는 제휴처 기업의 상품, 서비스
등에 관한 정보 제공 ③ 본 서비스 운영에 현저하게 영향을 미치는 사항(본 서비스
내용의 대대적인 변경, 일시 정지를 포함하되, 이에 한정되지 아니합니다)을
고객에게 연락하는 경우 ④ 고객정보 취급에 관한 동의를 요구하기 위해 고객에게
연락하는 경우 ⑤ 본 서비스 이용 상황 등과 관련된 통계정보 작성, 본 서비스 또는
당사 웹사이트 등을 통한 발표 및 제3자 제공 ⑥ 고객의 연령, 직업, 성별,
취미·기호 등에 맞춘 광고, 기타 정보의 제공 

(11) 당사는 법원, 검찰청, 경찰 등의 공공기관이 고객과 관련된 정보의
공개·제공을 요청할 경우, 고객의 승낙을 받지 않고 이에 따를 수 있습니다.

(12) 본 서비스와 관련하여 상품 선물 이벤트가 개최된 경우, 본 이용계약 외에
해당 이벤트 요강에 따라 진행됩니다. 

(13) 당사가 정한 방법으로 당첨자로 발표된 고객은 당사가 정한 절차에 따라
당첨자 본인이라는 사실이 확인된 시점에서 당첨이 확정됩니다. 또한 이에 따라
상품 발송처 등 당사가 요구하는 정보를 통지합니다. 

(14) 당첨 발표 후 10일 이내에 전항의 절차가 종료되지 않을 경우, 상품 수령까지
본 이용계약을 해제한 경우 또는 본 이용계약을 위반한 경우, 당사는 당첨자로서의
권리를 상실시킬 수 있습니다. 

(15) 고객은 본 서비스 이용 시에 다음과 같은 행위를 하지 아니합니다. ① 본
이용계약을 위반하는 행위 ② 허위 정보로 본 서비스 등록 절차를 하는 행위 ③ 다른
고객의 개인정보를 부당하게 수집, 축적, 이용하는 행위 ④ 피해를 주는 행위,
괴롭히는 행위, 비방·중상행위 등 다른 고객에게 정신적 피해 및 경제적 피해를
주는 행위 ⑤ 당사, 당사가 라이선스를 받고 있는 라이센스, 기타 고객 혹은 기타
제3자의 지적 재산권, 기타 재산권 혹은 인격적인 권리를 침해하는 행위 또는 이를
침해할 우려가 있는 행위 ⑥ 당사 및 제3자의 권리 및 이익을 침해하거나 그러한
우려가 있는 행위 ⑦ 법령 또는 규칙 등을 위반하는 행위 ⑧ 선량한 풍속 기타
사회질서에 위배되는 행위 혹은 그러한 우려가 있는 행위 또는 선량한 풍속 기타
사회질서에 위배 될 우려가 있는 정보를 다른 고객 혹은 제3자에게 제공하는 행위 ⑨
범죄행위, 범죄행위와 결부된 행위 혹은 이를 조장하는 행위 또는 그러한 우려가
있는 행위 ⑩ 사실과 다른 정보 또는 사실과 다를 우려가 있는 정보를 제공하는 행위
⑪ 당사 시스템 부정접속, 컴퓨터 바이러스 배포, 서버 또는 네트워크에 크게 부하를
주는 행위, 기타 본 서비스의 정상적인 운영을 방해하는 행위 또는 그러한 우려가
있는 행위 ⑫ 당사의 명예 및 본 서비스의 신용을 훼손하는 행위 또는 그러한 우려가
있는 행위 ⑬ 본 서비스를 이용한 영리 행위 또는 그 준비 행위 ⑭ 당사 혹은 당사의
모회사, 자회사, 관련 회사, 그 외 그룹 회사 혹은 그 임직원, 기타 고객, 그 외 본
서비스와 관련된 인물 혹은 단체 등을 가장하거나 신분을 속이는 행위 또는 그러한
우려가 있는 행위 ⑮ 청소년의 심신 및 그 건전한 육성에 악영향을 줄 우려가 있는
행위 ⑯ 이성과의 만남 등을 원하거나 유도하는 것을 목적으로 하는 행위 ⑰ 계정, 본
서비스 내의 콘텐츠, 기타 본 서비스상 고객이 이용 가능한 권리 또는 이익의 전부
또는 일부를 현금, 기타 재산상의 이익을 대가로 제3자에게 양도하거나 이용하게
하는 행위 및 그 광고, 선전, 고지, 권유 행위 ⑱ 당사 승낙 없이 여러 계정을
보유하거나 공통 계정을 여러 명이 공유하는 행위 ⑲ 그 외 당사가 부적절하다고
판단하는 행위 

(16) 본 서비스에 관한 모든 정보, 프로그램, 상표, 상호, 기타 이에 부수하는 편집
저작권 등을 포함한 저작권, 상표권, 기타 지적재산권 등의 모든 권리는 당사 또는
저작권을 보유한 제3자에게 귀속됩니다. 

(17) 고객이 본 서비스의 내용을 당사에 무단 전재, 복제, 개변, 공중 송신, 저장,
기타 사적 사용의 범위를 넘어서 이용하는 것을 금지합니다. 

(18) 본 서비스에서 게시판, 게시글 등 고객이 본 서비스를 통해 송신한 정보(이하
‘송신 정보’라 합니다)는 당사에 대해 복제, 공중 송신(송신 가능화를 포함), 기타
배포 등을 하는 무상의 비독점적인 권리를 허락한 것으로 간주합니다. 또한 고객은
송신 정보와 관련된 저작인격권을 주장하지 아니합니다. 

(19) 고객은 아래 각호에 해당하는 정보를 송신해서는 안됩니다. 송신 정보가 아래
각 호에 해당한다고 당사가 판단한 경우, 고객에게 통보하지 않고 삭제, 변경할 수
있습니다. 단, 당사는 송신 정보의 삭제 및 변경 의무 및 고객의 행위를 감시할
의무를 부담하지 아니합니다. ① 본 서비스의 취지에 위배되는 정보 ② 스스로 저작권
등 지적재산권을 가지지 않거나 권리자의 허락을 받지 않은 표현을 포함한 정보 ③
본인이 송신을 허락하지 않은 개인정보(여러 정보의 조합으로 개인을 특정할 수
있는 정보를 포함합니다) ④ 선량한 풍속 기타 사회질서에 위배되는 표현을 포함한
정보 ⑤ 정치, 종교, 영업을 목적으로 하는 표현을 포함한 정보 ⑥ 제3자의 권리를
침해하는 표현을 포함한 정보 ⑦ 일반적으로 다른 고객에게 불쾌함을 주는 표현을
포함한 정보 ⑧ 범죄 예고 등 생명이나 재산에 위험을 줄 우려가 있는 표현을 포함한
정보 ⑨ 다른 고객과의 직접적인 만남을 목적으로 하는 표현을 포함한 정보 ⑩ 당사의
본 서비스 제공에 방해가 되는 표현을 포함한 정보 ⑪ 그 외 당사가 적절하지 않다고
판단하는 표현을 포함한 정보 [게시물 이용 안내] POCA내 피드, 시크릿 메일을
포함한 모든 게시물 작성 시 아래의 조항이 적용되며, 위반 시 운영진에 의해 삭제
및 강제 탈퇴, 법적 조치가 가능합니다. ① 닉네임 개설시 비속어 및 성적 묘사
단어를 포함할 수 없습니다. ② 닉네임 개설시 가입 아티스트를 제외한 타
연예인이나 기획사의 이름을 사용할 수 없습니다. ③ 피드 및 시크릿 메일 작성시
욕설 및 성적 모욕감을 유발하는 언어를 사용할 수 없습니다. ④ 아이돌의 멤버 및
기획사 관계자를 사칭할 수 없습니다. ⑤ 아이돌 및 기획사 관련 루머 및 사생활
관련 언급할 수 없습니다. ⑥ 타 기획사 및 타 아티스트 관련된 글은 작성하실 수
없습니다. ⑦ 홍보 및 상업성, 타인 비방 글은 게시할 수 없습니다. ⑧ 회원간 분란을
조장할 수 있는 글은 게시할 수 없습니다. ⑨ 어떠한 금전거래 관련 게시글을
허용하지 않습니다. 

(20) 당사는 고객 정보 및 콘텐츠 저장 의무를 부담하지 아니하며, 그 완전성,
가용성에 대해 보증하지 아니합니다. 고객은 고객 정보 및 콘텐츠를 보전하고자 할
경우, 자기 책임 하에 백업합니다. 

(21) 고객이 본 서비스용 설비에 축적한 데이터 등이 소실(본인이 삭제한 것을
포함)한 경우 또는 타인이 위조한 경우, 당사는 이를 복구할 책임을 부담하지
아니합니다. 

(22) 본 서비스는 현재 상태에서 완전성, 정확성, 유용성, 신뢰성 등에 하자를
포함할 수 있는 것으로서 제공됩니다. 당사는 본 서비스의 제공 및 내용에 대해 그
완전성, 정확성, 유용성, 신뢰성 등에 관한 어떠한 보증도 하지 아니합니다.

(23) 고객이 본 서비스에 게재되어 있는 정보 및 이와 관련된 콘텐츠를 이용하는
경우에는 이용 목적에 따라 고객 자신의 판단과 책임 하에 이용하십시오. 또한
어떠한 경우에도 고객이 본 서비스의 정보 또는 콘텐츠를 이용한 결과로 인해
발생한 손해에 대해서 당사는 일체 책임을 부담하지 아니합니다. 

(24) 당사는 본 서비스에서 링크를 통해 접속 가능한 모든 제3자 웹사이트에 대하여
그 적법성, 정합성, 안전성, 정확성, 선량한 풍속 기타 사회질서에 위배되지 않는
점 등을 보증하지 아니합니다. 

(25) 당사는 본 서비스상에서 실시되는 광고의 광고주 등과 고객간의 모든 분쟁,
약속, 보증 등 및 결과적으로 고객에게 발생하는 일체의 손실, 손해에 대하여
책임을 부담하지 아니합니다. 

(26) 당사는 고객이 본 서비스를 통해 실시하는 제3자와의 거래에는 일체 관여하지
아니합니다. 또한 본 서비스를 통해 어떠한 정보의 정확성도 보증하지 아니합니다.
고객은 다른 고객과 발생한 모든 분쟁에 대해 자기 책임 하에 해결합니다.

(27) 당사는 고객에 대해 본 서비스에 대한 부정 접속, 컴퓨터 바이러스 침입 등
제3자의 행위를 원인으로 하여 고객에게 발생하는 모든 손해에 대해 책임을
부담하지 아니합니다. 

(28) 당사는 본 서비스를 이용하기 위해 개개의 고객이 사용하는 기기, 설비,
소프트웨어 및 통신서비스 등에 관한 지원을 하지않습니다. 또한 당사는 당사가
관리하는 설비 및 소프트웨어 설정 등이 개개의 고객이 사용하는 기기, 설비,
소프트웨어 또는 통신 서비스 등에 적합하지 않는 경우라도 이러한 변경, 개변 등을
할 의무를 부담하지 않습니다. 

(29) 당사는 본 서비스에 관한 고객의 문의나 개선 등의 의견 등에 대해 전부
답변하거나 어떠한 대응을 실시할 의무를 부담하지 아니하며, 자기 재량 및 임의의
판단으로 이를 실시합니다. 당사는 고객 문의, 의견 등의 내용에 대해 어떠한
대응을 실시할 수 있지만, 당사의 해당 행위는 해당 고객에 대해 개별적으로 답변
및 보고, 금전적인 보상 등을 할 의무를 부담하는 것으로 해석되지 아니합니다.

(30) 본 서비스의 제공에 필요한 설비의 보수를 정기적으로 또는 긴급하게 실시하는
경우, 해당 설비에 장애가 발생한 경우, 기타 당사가 필요하다고 판단한 경우,
당사는 고객에게 예고하지 않고 본 서비스 제공을 중단할 수 있습니다. 이 경우, 이
사항에 관하여 당사는 고객에 대해 책임을 부담하지 아니합니다. 

(31) 본 이용계약이 해제되는 경우에는 고객은 당사가 정한 절차에 따라 탈퇴
절차를 진행합니다. 

(32) 당사는 고객이 본 이용계약을 해제한 경우 또는 당사가 본 서비스의 운영을
종료한 경우에는 당사의 판단 하에 고객과 관련된 정보 및 콘텐츠를 모두 삭제할 수
있으며, 그 반환 등의 요청에는 응하지 아니합니다. 

(33) 고객은 본 이용계약을 해제할 경우, 해당 시점에서 당사에 대해 가지고 있는
모든 채무를 즉시 이행합니다. 

(34) 고객과 전기통신사업자 등 간의 계약이 종료된 경우, 해당 계약의 종료일을
기하여 본 이용계약도 해제됩니다. 

(35) 당사는 고객이 지급해야 할 이용료를 지급하지 아니한 경우, 그 외 본
이용계약을 위반한 경우, 고객에 대한 본 서비스의 제공을 정지하고, 고객에게
통지, 최고하지 않고 본 이용계약을 해제할 수 있습니다. 

(36) 본 서비스 이용 시에 고객 또는 제3자에게 손해가 발생한 경우라도 당사는
해당 손해에 대해서는 책임을 부담하지 아니합니다. 또한 고객이 한 번 지급한 금전
등에 대해 그 이유를 불문하고 환불하지 아니합니다. 다만, 당사의 고의 또는
중대한 과실에 의한 손해에 대해서는 그러하지 아니합니다. 

(37) 고객은 본 이용계약과 관련된 어떠한 권리 또는 의무도 제3자에게 이전하거나
양도할 수 없습니다. 

(38) 당사는 본 서비스 및 본 이용계약을 예고 없이 개정, 추가, 변경 또는
폐지(이하, 총칭하여 ‘개정 등’이라 합니다)할 수 있습니다. 또한 개정 등을 한
후의 본 이용계약에 대해서는 개정 등의 30일 전까지 본 서비스상에 고지되며, 개정
등을 한 후에 효력발생까지 해지 절차를 하지 않은 경우에는 개정 등을 한 후의 본
이용계약에 동의한 것으로 봅니다. 

(39) 본 이용계약 외에 당사가 정한 제반 규정이 있는 경우에는 각각 본 이용계약의
일부를 구성합니다.

(40) 본 이용계약은 그 일부가 소비자보호법령의 강행규정 부분 또는 다른
강행규정에 의해 효력을 가지지 않는 경우에도 이에 위배되지 않은 최대한의
범위에서 효력을 가집니다.

(41) 본 이용계약은 한국법을 준거법으로 합니다. 본 서비스 또는 본 이용계약과
관련하여 고객과 사이에 의의(疑義) 또는 분쟁이 발생한 경우에는 성의를 가지고
협의하되, 여전히 해결되지 아니한 경우에는 서울지방법원 또는 자사 관할의 법원을
합의 관할법원으로 합니다.
시행일 : 2024년1월 1’0일
          </textarea>
        </div>
        <div class="modal-footer">
          <button type="button" class="btn btn-secondary" data-bs-dismiss="modal">
            확인
          </button>
        </div>
      </div>
    </div>
  </div>
 <div class="modal fade" tabindex="-1" id="gaein">
    <div class="modal-dialog modal-dialog-centered modal-dialog-scrollable">
      <div class="modal-content changeModal longTextModal">
        <div class="modal-header">
          <h5 class="modal-title">개인정보 처리 방침</h5>
        </div>
        <div class="modal-body">
          <textarea readonly>
POCA 서비스 이용에 관한 약관이며, 서비스를 이용함은 아래 약관을 동의하는것으로
간주합니다. 당사는 고객으로부터 제공받은 개인정보의 중요성을 인식하고
개인정보를 취급하는 기업의 사회적 책임을 통해 고객의 개인정보를 본 방침에 따라
적절히 관리하겠습니다.

1. 개인정보의 수집 당사는 고객이 당사 서비스를 이용할 때에 다음에 열거하는
고객 개인을 식별할 수 있는 정보 및 고객 고유의 정보를 수집하는 경우가
있습니다. ①고객 개인에 관한 정보: 고객이 본 서비스에 등록하여 당사에 송신한
계정명(고객의 실명인 경우를 포함합니다), 생년월일 및 성별, 출신지 등 ②이용중인
휴대폰 단말기에 관한 정보: 사용 디바이스, OS, 단말기 언어 설정 ③통신 환경에
관한 정보: 통신사, 통신 환경, 접속국가·지역 등 ④이용 상황에 관한 정보: 본
서비스의 버전, 본 서비스의 이용이력 등 당사는 고객으로부터 개인정보를 제공받은
경우에는 서비스별로 이용 목적, 이용 방법, 이용 범위, 당사의 고객 창구, 당사가
고객의 개인정보를 제공하는 제휴사(제공받은 개인정보를 당사와 공유하는 회사)의
범위 등을 사전에 통지하거나 웹사이트 등을 통해 발표한 후에 동의를 받아 필요한
범위의 개인정보를 보관하겠습니다. 당사는 서비스 등록 및 서비스 이용 과정에서
고객이 개인정보수집에 동의하고 스스로 입력한 정보를 수집합니다. 또한
기기정보와 같이 생성정보는 PC웹, 모바일웹, 앱 이용과정에서 자동생성된 정보를
수집합니다.

2. 개인정보의 이용 목적 당사에서는 고객으로부터 제공받은 개인정보를 서비스별로
통지하거나 발표할 목적으로 이용하고 있습니다. 당사는 본 이용 목적의 범위를
넘어서 고객의 동의 없이 개인정보를 이용하지 아니합니다. 또한 당사에서는
제공받은 개인정보를 연령 분포, 취미 기호 분포, 이용 이력 등으로 통계적으로
처리한 후에 제3자에게 제공하거나 일반에 공개하는 경우가 있습니다만, 이
정보들은 개인을 특정할 수 없습니다.

3. 개인정보의 제공 공개 당사는 고객의 동의 없이 제3자에게 개인정보를 제공,
공개하지 아니합니다. 당사는 사전에 이용규약 등에 따라 고객의 동의를 받아 각
서비스에 필요한 범위에서 당사의 제휴사 및 업무위탁처에 개인정보를 공개하는
경우가 있습니다만, 이 경우 해당 제휴사 및 업무위탁처가 개인정보를 유출하여
다시 제공하는 등 사전에 정해진 이용 목적을 넘어서 이용하지 않도록
비밀유지계약을 체결하는 등 적절한 조치를 취하고 있습니다. 단 당사는 법원,
검찰청, 경찰 등 공공기관의 요청 또는 법령에 따라 정보 공개, 제공을 요청 받은
경우에만 협조할 수 있습니다.

4. 개인정보의 안전 관리 당사는 고객의 개인정보 취급과 관련하여 정보의 유출,
멸실, 훼손, 위조, 부정접속 등의 방지, 기타 안전 관리를 위하여 최대한 노력하며
필요하고 적절한 조치를 취하고 있습니다. 당사는 개인정보를 취급하는 종업원을
이용 목적에 따라 필요한 범위 내로 한정하고 있으며, 서비스별로 고객의
개인정보를 취급하는 관리책임자를 두어 필요한 관리 감독을 실시하고 있습니다.

5. 개인정보의 권리 행사 및 보유기간 당사는 개인정보를 정확하고 최신 내용으로
유지하기 위하여 노력합니다. 고객의 개인정보와 관련하여 열람, 정정, 삭제,
처리정지를 희망할 경우에는 각 서비스에 제시된 순서에 따라 신청하십시오.
당사에서 적절한 본인 확인 후에 합리적인 범위에서 신속히 대응하겠습니다.
원칙적으로, 개인정보 수집 및 이용목적이 달성된 후에는 해당 정보를 지체 없이
파기합니다. 단, 관계법령의 규정에 의하여 보존할 필요가 있는 경우 회사는 아래와
같이 관계법령에서 정한 일정한 기간 동안 회원정보를 보관합니다. 이 경우 회사는
해당 개인정보를 별도의 데이터베이스(DB)로 옮기거나 보관장소를 달리하여
보존합니다. - 계약 또는 청약철회 등에 관련 기록: 5년 (전자상거래 등에서의
소비자보호에 관한 법률) - 대금결제 및 재화 등의 공급에 관한 기록: 5년
(전자상거래 등에서의 소비자보호에 관한 법률) - 소비자의 불만 또는 분쟁처리에
관한 기록: 3년 (전자상거래 등에서의 소비자보호에 관한 법률) - 신용정보의
수집/처리 및 이용 등에 관한 기록: 3년 (신용정보의 이용 및 보호에 관한 법률) -
표시/광고에 관한 기록: 6개월 (전자상거래 등에서의 소비자보호에 관한 법률) -
이용자의 인터넷 등 로그기록/이용자의 접속지 추적자료: 3개월 (통신비밀보호법) -
그 외의 통신사실 확인자료: 12개월 (통신비밀보호법)

6.개인정보의 파기절차 및 파기 방법 회사는 원칙적으로 개인정보 수집 및
이용목적이 달성된 후에는 해당 정보를 지체 없이 파기합니다. 파기절차 및 방법은
다음과 같습니다. (1) 파기절차 이용자의 개인정보는 목적이 달성된 후 별도의 DB로
옮겨져(종이의 경우 별도의 서류함) 내부 방침 및 기타 관련 법령에 의한 정보보호
사유에 따라(보유 및 이용기간 참조) 일정 기간 저장된 후 파기됩니다. 별도 DB로
옮겨진 개인정보는 법률에 의한 경우가 아니고서는 보유되는 이외의 다른 목적으로
이용되지 않습니다. (2) 파기방법 전자적 파일형태로 저장된 개인정보는 기록을
재생할 수 없는 기술적 방법을 사용하여 삭제합니다. 종이에 출력된 개인정보는
분쇄기로 분쇄하거나 소각을 통하여 파기합니다.

7. 14세 미만 고객의 개인정보 당사에서는 만14세 미만 고객의 개인정보는
법정대리인의 동의를 얻어 수집하며, 개인정보 보호에 대해서도 최대한
주의하겠습니다. 만 14세 미 만 아동의 경우, 법정대리인이 아동의 개인정보를
조회하거나 수정할 권리, 수집 및 이용동의를 철회할 권리를 가집니다.

8. 개인정보의 공개 청구 고객이 자신의 개인정보 등록 내용에 대해 조회하고자 할
경우에는 각 서비스의 문의 창구로 본인또는 법정대리인이 신청해 주십시오.
당사에서 적절한 본인 확인 후에 합리적인 범위에서 신속히 대응하겠습니다. 참고로
수수료가 별도로 부과되는 경우도 있습니다.

9. 개인정보처리방침을 변경할 경우의 절차 본 방침을 변경해야 할 경우, 사내에
설치된 정보보안위원회에서 심사, 승인 후에 변경합니다. 참고로 변경을 한 경우,
서비스별로 알림 페이지 등 소정 장소에 게재하는 방법을 통해 고객에게
통지합니다.

10. 이력정보 등에 대해 (1) 이력정보 등의 취득, 이용, 제공 당사에서는
행동타겟팅광고 및 트래픽조사, 기타 이용목적 달성에 필요한 범위에서 이력정보
등을 고객이 당사 및 당사 제휴처(광고주, 광고배포처 등을 포함) 사이트를 열람한
때에 취득하는 경우가 있습니다. 참고로 이력정보 등이란 열람한 웹사이트 및 광고
이력, Cookie등 특정 개인을 식별할 수 없는 정보를 의미합니다. 행동타겟팅광고
배포에 앞서 여러 개의 이력정보 등을 조합하여 이용하는 경우가 있는데, 이를
통해서도 특정 개인을 식별할 수 있는 정보는 되지 않습니다. 당사는 이력정보 등의
이용 및 제3자에 대한 제공에 앞서 고객들에게 이용 목적 및 제공의 구체적인
내용을 명시하고, 명시한 목적 외에 이력정보 등을 이용하거나 제3자에 제공하지
아니합니다. (2) 이력정보 등의 이용 목적 당사의 이력정보 등을 이용하는 목적은
다음과 같습니다. ·행동 타겟팅 광고 배포, 기타 고객의 흥미 관심에 맞춘 상품
서비스 등의 정보 제공의 참고 ·고객의 동향 조사, 분석 및 본 서비스의 원활한
제공, 수정, 개량, 신규 기획, 개발 ·고객을 대상으로 여러 차례에 걸쳐 동일한
광고를 노출하지 않는 등의 조정 ·고객을 대상으로 보다 최적화된 광고를 배포하기
위한 가공 및 수정, 분석 ·개인을 특정하는 정보를 포함하지 않는 정보로 구성된
통계적 자료를 작성 ·고객 문의 등에 대한 대응 등 고객의 이용정보를 확인 (3)
이용자의 거부권(이른바, Opt-out) 고객은 자신의 책임 하에 설정을 변경함으로써
Cookie 기능을 무효화할 수 있습니다. 단, 그 결과 웹페이지상의 전부 또는 일부
이용이 불가한 경우가 있으므로, 미리 양해 바랍니다. Cookie 기능의 정지에 관한
정보는 이용 브라우저의 설정 등을 참조하십시오. (4) 기타 제3자 기업이 제공하는
행동 타겟팅 광고 등의 이용에 대해 당사는 당사 서비스를 광고하거나 이용상황을
파악하는 등의 목적으로 제3자 기업이 제공하는 행동타겟팅광고 등의 서비스를
이용할 수 있으며, 고객은 이에 동의하는 것으로 합니다. 이 경우, 제3 자 기업이
고객의 이력 정보 등을 취득 및 이용하는 경우가 있습니다만, 해당 제3자 기업이
취득하는 이력정보 등에는 특정 개인을 식별하는 정보는 전혀 포함되지 아니합니다.
또한 이 정보들은 해당 제3자 기업의 개인정보처리방침에 따라 관리됩니다. 이러한
행동 타겟팅 광고 등의 서비스를 무효화하고자 할 경우, 고객이 직접
거부(Opt-out)할 수 있습니다. 서비스 목록 및 옵트 아웃 방법에 대해서는 여기를
참조하십시오.

11. 개인정보의 국외전송 - 이전되는 개인정보 항목: 1①~④에 규정한 항목 -
POCA서비스운영에 필요한 개인정보는 국외전송항목이 없습니다.
12. 관련 법령의 준수 당사는 당사가 보유하는 개인정보 취급에 대해 일본의 법령을
준수하고 적절히 그 개선에 힘쓰겠습니다. 본 방침에 관한 문의는 개인정보업무와
민원사항을 처리하는 고객상담실 kh.ju@2sbreakers.com로 이용중인 서비스를
명시하여 보내 주십시오.
시행일 : 2024년 1월 10일
          </textarea>
        </div>
        <div class="modal-footer">
          <button type="button" class="btn btn-secondary" data-bs-dismiss="modal">
            확인
          </button>
        </div>
      </div>
    </div>
  </div>
</template>

<script>
import "aos/dist/aos.css";
import AOS from "aos";
export default {
  data() {
    return {
      id: "kimnerd91",
      email: "kimnerd91@gmail.com",
      darkMode: false,
    };
  },
  mounted() {
    AOS.init();
  },
  methods: {
    toggleDarkMode() {
      this.darkMode = !this.darkMode;
      this.$emit('dark-mode-changed', this.darkMode); // Emitting event to parent
      console.log(this.darkMode);
    },
  },
  created() {
    // prefers-color-scheme가 dark인지 확인
    const prefersDarkMode = window.matchMedia("(prefers-color-scheme: dark)").matches;
    if (prefersDarkMode) {
      this.darkMode = true;
      this.$emit('dark-mode-changed', this.darkMode); // Emitting event to parent
    }
  },
  computed: {
    isDarkModeActive() {
      return this.darkMode;
    }
  }
};
</script>

<style>
.colorBtn {
  width: 10.6vw;
  height: 6.4vw;
}


</style>
